# Условие: Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Решение: 
print(len(set(input().split())))
# возвращает длину, создает множество и разбивает строку на части
