# Условие: Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке.
# Решение: 
b = int(input())
h = int(input())
print(h*b*0.5)
