# Условие: Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
# Решение: 
n = str(input())
print("Hello, " +  n + "!")
